{
    "planets" : [
                 {
                 "name" : "Mercury",
                 "mass" : 0.055,
                 "period" : 0.240,
                 "rotationPeriod" : 58.650,
                 "A" : 69.800,
                 "P" : 46,
                 "E" : 0.205,
                 "distance" : 0.387,
                 "diameter" : 0.382,
                 "angle" : 0,
                 "materials": {
                    "diffuse": "art.scnassets/MercuryTexture.jpg"
                 },
                 "info": "Mercury's eccentric orbit takes the small planet as close as 47 million km (29 million miles) and as far as 70 million km (43 million miles) from the sun. If one could stand on the scorching surface of Mercury when it is at its closest point to the sun, the sun would appear more than three times as large as it does when viewed from Earth. Temperatures on Mercury's surface can reach 800 degrees Fahrenheit (430 degrees Celsius). Because the planet has no atmosphere to retain that heat, nighttime temperatures on the surface can drop to -290 degrees Fahrenheit (-180 degrees Celsius).\n\nBecause Mercury is so close to the sun, it is hard to directly observe from Earth except during dawn or twilight. Mercury makes an appearance indirectly -- 13 times each century, observers on Earth can watch Mercury pass across the face of the sun, an event called a transit. These rare transits fall within several days of 8 May and 10 November. The first two transits of Mercury in the 21st century occurred 7 May 2003, and 8 November 2006. The next are 9 May 2016, and 11 November 2019.\n\nMercury speeds around the sun every 88 days, traveling through space at nearly 50 km (31 miles) per second, faster than any other planet. One Mercury solar day (one day-night cycle) equals 175.97 Earth days.\n\nInstead of an atmosphere, Mercury possesses a thin exosphere made up of atoms blasted off the surface by the solar wind and striking micrometeoroids. Because of solar radiation pressure, the atoms quickly escape into space and form a tail of neutral particles. Though Mercury's magnetic field at the surface has just one percent the strength of Earth's, it interacts with the magnetic field of the solar wind to episodically create intense magnetic tornadoes that funnel the fast, hot solar wind plasma down to the surface. When the ions strike the surface, they knock off neutrally charged atoms and send them on a loop high into the sky.\n\nMercury's surface resembles that of Earth's Moon, scarred by many impact craters resulting from collisions with meteoroids and comets. Very large impact basins, including Caloris (1,550 km, or 960 miles, in diameter) and Rachmaninoff (306 km, or 190 miles), were created by asteroid impacts on the planet's surface early in the solar system's history. While there are large areas of smooth terrain, there are also lobe-shaped scarps or cliffs, some hundreds of miles long and soaring up to a mile high, formed as the planet's interior cooled and contracted over the billions of years since Mercury formed.\n\nMercury is the second densest planet after Earth, with a large metallic core having a radius of about 2,000 km (1,240 miles), about 80 percent of the planet's radius. In 2007, researchers used ground-based radars to study the core, and found evidence that it is partly molten (liquid). Mercury's outer shell, comparable to Earth's outer shell (called the mantle and crust), is only about 400 km (250 miles) thick.\n\nThe first spacecraft to visit Mercury was Mariner 10, which imaged about 45 percent of the surface. NASA's MErcury Surface, Space ENvironment, GEochemistry, and Ranging (MESSENGER) mission flew by Mercury three times in 2008-2009 and has been in orbit around the planet since 18 March 2011. Almost the entire planet has now been imaged, revealing a surface that has been shaped both by extensive volcanism and impacts.\n\nData from MESSENGER's scientific instruments have provided a trove of scientific discoveries. These include the identification of a new landform known as hollows, measurements indicating that Mercury has a remarkably high abundance of the volatile elements sulfur and potassium, and the discoveries that Mercury's magnetic field is offset relative to the planet's equator and that the planet has a highly unusual internal structure. In 1991, astronomers on Earth using radar observations showed that Mercury may have water ice at its north and south poles inside deep craters. MESSENGER observations have shown that the materials identified by radar are present only in regions of permanent shadow, consistent with the idea that they are cold enough to preserve water ice, despite the extreme high temperatures experienced by sunlit parts of the planet.\n\nHow Mercury Got its Name\n\nMercury is appropriately named for the swiftest of the ancient Roman gods. Mercury, the god of commerce, is the Roman counterpart to the ancient Greek god Hermes, the messenger of the gods.\n\nSignificant Dates\n\n1631: Thomas Harriott and Galileo Galilei observe Mercury with the newly invented telescope.\n\n1631: Pierre Gassendi uses a telescope to watch from Earth as Mercury crosses the face of the sun.\n\n1965: Incorrectly believing for centuries that the same side of Mercury always faces the sun, astronomers find that the planet rotates three times for every two orbits.\n\n1974-1975: Mariner 10 photographs roughly half of Mercury's surface in three flybys.\n\n1991: Scientists using Earth-based radar find signs of ice locked in permanently shadowed areas of craters in Mercury's polar regions.\n\n2008-2009: MESSENGER observes Mercury during three flybys.\n\n2011: MESSENGER begins its orbital mission at Mercury, yielding a treasure trove of images, compositional data and scientific discoveries."
                 },
                 {
                 "name" : "Venus",
                 "mass" : 0.815,
                 "period" : 0.620,
                 "rotationPeriod" : 243,
                 "A" : 108.900,
                 "P" : 107.500,
                 "E" : 0.007,
                 "distance" : 0.723,
                 "diameter" : 0.949,
                 "angle" : 177.400,
                 "materials": {
                    "diffuse": "art.scnassets/VenusTexture.jpg"
                 },
                 "info": "Venus is the second planet from the sun and our closest planetary neighbor.\nSimilar in structure and size to Earth, Venus spins slowly in the opposite direction most planets do. Its thick atmosphere traps heat in a runaway greenhouse effect, making it the hottest planet in our solar system with surface temperatures hot enough to melt lead. Glimpses below the clouds reveal volcanoes and deformed mountains.\n\nVenus is named for the ancient Roman goddess of love and beauty, the counterpart to the Greek goddess Aphrodite.\n\nSize and Distance\n\nWith a radius of 3,760 miles (6,052 kilometers), Venus is roughly the same size as Earth, just slightly smaller.\n\nFrom an average distance of 67 million miles (108 million kilometers), Venus is 0.7 astronomical units away from the sun. One astronomical unit (abbreviated as AU), is the distance from the sun to Earth. From this distance, it takes sunlight 6 minutes to travel from the sun to Venus.\n\nOrbit and Rotation\n\nVenus' rotation and orbit are unusual in several ways. Venus is one of just two planets that rotate from east to west. Only Venus and Uranus have this \"backwards\" rotation. It completes one rotation in 243 Earth days — the longest day of any planet in our solar system, even longer than a whole year on Venus. But the sun doesn't rise and set each \"day\" on Venus like it does on most other planets. On Venus, one day-night cycle takes 117 Earth days because Venus rotates in the direction opposite of its orbital revolution around the sun.\n\nVenus makes a complete orbit around the sun (a year in Venusian time) in 225 Earth days or slightly less than two Venusian day-night cycles. Its orbit around the sun is the most circular of any planet — nearly a perfect circle. Other planet's orbits are more elliptical, or oval-shaped.\n\nWith an axial tilt of just 3 degrees, Venus spins nearly upright, and so does not experience noticeable seasons.\n\nFormation\n\nWhen the solar system settled into its current layout about 4.5 billion years ago, Venus formed when gravity pulled swirling gas and dust in to become the second planet from the sun. Like its fellow terrestrial planets, Venus has a central core, a rocky mantle and a solid crust.\n\nStructure\n\nVenus is in many ways similar to Earth in its structure. It has an iron core that is approximately 2,000 miles (3,200 kilometers) in radius. Above that is a mantle made of hot rock slowly churning due to the planet's interior heat. The surface is a thin crust of rock that bulges and moves as Venus' mantle shifts and creates volcanoes.\n\nSurface\n\nFrom space, Venus is bright white because it is covered with clouds that reflect and scatter sunlight. At the surface, the rocks are different shades of grey, like rocks on Earth, but the thick atmosphere filters the sunlight so that everything would look orange if you were standing on Venus.\n\nVenus has mountains, valleys, and tens of thousands of volcanoes. The highest mountain on Venus, Maxwell Montes, is 20,000 feet high (8.8 kilometers), similar to the highest mountain on Earth, Mount Everest. The landscape is dusty, and surface temperatures reach a scalding 880 degrees Fahrenheit (471 degrees Celsius).\n\nIt is thought that Venus was completely resurfaced by volcanic activity 300 to 500 million years ago. Venus has two large highland areas: Ishtar Terra, about the size of Australia, in the north polar region; and Aphrodite Terra, about the size of South America, straddling the equator and extending for almost 6,000 miles (10,000 kilometers).\n\nVenus is covered in craters, but none are smaller than 0.9 to 1.2 miles (1.5 to 2 kilometers) across. Small meteoroids burn up in the dense atmosphere, so only large meteoroids reach the surface and create impact craters.\n\nAlmost all the surface features of Venus are named for amazing Earth women. A volcanic crater is named for Sacajawea, the Native American woman who guided Lewis and Clark's exploration. A deep canyon is named for Diana, Roman goddess of the hunt.\n\nAtmosphere\n\nVenus' atmosphere consists mainly of carbon dioxide, with clouds of sulfuric acid droplets. The thick atmosphere traps the sun's heat, resulting in surface temperatures higher than 880 degrees Fahrenheit (470 degrees Celsius). The atmosphere has many layers with different temperatures. At the level where the clouds are, about 30 miles up from the surface, it's about the same temperature as on the surface of the Earth.\n\nAs Venus moves forward in its solar orbit while slowly rotating backwards on its axis, the top level of clouds zips around the planet every four Earth days, driven by hurricane-force winds traveling at about 224 miles (360 kilometers) per hour. Atmospheric lightning bursts light up these quick-moving clouds. Speeds within the clouds decrease with cloud height, and at the surface are estimated to be just a few miles per hour.\n\nOn the ground, it would look like a very hazy, overcast day on Earth. And the atmosphere is so heavy it would feel like you were 1 mile (1.6 kilometers) deep underwater.\n\nPotential for Life\n\nNo human has visited Venus, but the spacecraft that have been sent to the surface of Venus do not last very long there. Venus' high surface temperature overheat electronics in spacecraft in a short time, so it seems unlikely that a person could survive for long on the Venusian surface.\n\nThere is speculation about life existing in Venus' distant past, as well as questions about the possibility of life in the top cloud layers of Venus' atmosphere, where the temperatures are less extreme.\n\nMoons\n\nVenus has no moons.\n\nRings\n\nVenus has no rings  \n\nMagnetosphere\n\nEven though Venus is similar in size to the Earth and has a similarly-sized iron core, Venus' magnetic field is much weaker than the Earth's due to Venus' slow rotation.\n\nExploration\n\nThe brightest object in the night sky on Earth (besides our moon), Venus has been observed for millennia. And as one of just two bodies between Earth and the sun, Venus periodically passes across the face of the sun — a phenomenon called a transit. Observing transits of Venus has helped astronomers study the nearby planet and better understand the solar system and our place in it. Transits of Venus occur in pairs with more than a century separating each pair, occurring in 1631 and 1639; 1761, 1769; 1874, 1882; and 2004, 2012. The next transit isn't until December 2117. Such long gaps occur between transits because Earth's and Venus' orbits around the sun are inclined differently, so Venus much more often passes between Earth and the sun without crossing the face of the sun from our perspective.\n\nMissions to Venus >\n\nSignificant Dates:\n650 BCE: Mayan astronomers make detailed observations of Venus, leading to a highly accurate calendar.\n1610: Galileo Galilei documents the phases of Venus in The Starry Messenger.\n1639: The first predicted transit of Venus is observed in England.\n1761-1769: Two European expeditions to watch Venus cross in front of the sun lead to the first good estimate of the sun's distance from Earth.\n1961: Radar returns from Venus are used to determine the most accurate value (at the time) for the sun's distance from Earth. (Published in 1962.)\n1962: NASA's Mariner 2 reaches Venus and reveals the planet's extreme surface temperatures. It is the first spacecraft to send back information from another planet.\n1970: The Soviet Union's Venera 7 sends back 23 minutes of data from the surface of Venus. It is the first spacecraft to successfully land on another planet.\n1990-1994: NASA's Magellan spacecraft, in orbit around Venus, uses radar to map 98 percent of the planet's surface.\n2005: The European Space Agency launches Venus Express to study the atmosphere and surface. The orbiter reached Venus in April 2006, and studied the planet through 2014.\n2015: After launching in 2010, Japan's Akatsuki (\"Dawn\") orbiter achieves orbit around Venus.\nPop Culture\n\nNamed after the goddess of love and beauty, Venus has become nearly synonymous with \"woman\" in popular culture, as referenced by the famous relationship guide Men are from Mars, Women are from Venus. As a solar system locale, Venus was a popular destination for early 20th century science fiction writers; before we knew about what lay beneath Venus' mysterious cloud cover, writers could speculate about a more hospitable planet and its possible inhabitants.\n\nMore recently, Venus has been a backdrop for video games such as Transhuman Space, Battlezone and Destiny. And in the Disney animated film The Princess and the Frog, Ray the firefly falls in love with Venus, \"the evening star,\" as he has mistaken it for another firefly."
                 },
                 {
                 "name" : "Earth",
                 "mass" : 1,
                 "period" : 1,
                 "rotationPeriod" : 1,
                 "A" : 152.100,
                 "P" : 147.100,
                 "E" : 0.017,
                 "distance" : 1,
                 "diameter" : 1,
                 "moons" : [
                            {
                            "name" : "Moon",
                            "material" : "art.scnassets/MoonTexture.jpg",
                            "period" : 2,
                            "diameter" : 0.25,
                            "distance" : 0.01
                            }
                            ],
                 "angle" : 23.450,
                 "materials": {
                    "diffuse": "art.scnassets/EarthDayTexture.jpg",
                    "emission":"art.scnassets/EarthNightTexture.jpg"
                 },
                 "info":"Earth is the third planet from the sun and the fifth largest in the solar system. Just slightly larger than nearby Venus, Earth is the biggest of the terrestrial planets. Our home planet is the only planet in our solar system known to harbor living things.\nThe name Earth is at least 1,000 years old. All of the planets, except for Earth, were named after Greek and Roman gods and goddesses. However, the name Earth is an English\/German word, which simply means the ground.\n\nThis page provides a brief overview of our home planet. For a comprehensive look at Earth, visit NASA's Earth Science Division.\nColor illustration showing the sun compared to Earth.\n\nSize and Distance\n\nWith a radius of 3,959 miles (6,371 kilometers), Earth is the biggest of the terrestrial planets, and the fifth largest planet overall.\n\nFrom an average distance of 93 million miles (150 million kilometers), Earth is exactly one astronomical unit away from the sun because one astronomical unit (abbreviated as AU), is the distance from the sun to Earth. This unit provides an easy way to quickly compare planets' distances from the sun.\n\nIt takes about eight minutes for light from the sun to reach our planet.\n\nOrbit and Rotation\n\nAs Earth orbits the sun, it completes one rotation every 23.9 hours. It takes 365.25 days to complete one trip around the sun. That extra quarter of a day presents a challenge to our calendar system, which counts one year as 365 days. To keep our yearly calendars consistent with our orbit around the sun, every four years we add one day. That day is called a leap day, and the year it's added to is called a leap year.\n\nEarth's axis of rotation is tilted 23.4 degrees with respect to the plane of Earth's orbit around the sun. This tilt causes our yearly cycle of seasons. During part of the year, the northern hemisphere is tilted toward the sun and the southern hemisphere is tilted away. With the sun higher in the sky, solar heating is greater in the north producing summer there. Less direct solar heating produces winter in the south. Six months later, the situation is reversed. When spring and fall begin, both hemispheres receive roughly equal amounts of heat from the sun.\n\nFormation\n\nWhen the solar system settled into its current layout about 4.5 billion years ago, Earth formed when gravity pulled swirling gas and dust in to become the third planet from the sun. Like its fellow terrestrial planets, Earth has a central core, a rocky mantle and a solid crust.\n\nStructure\n\nEarth is composed of four main layers, starting with an inner core at the planet's center, enveloped by the outer core, mantle and crust.\n\nThe inner core is a solid sphere made of iron and nickel metals about 759 miles (1,221 kilometers) in radius. There the temperature is as high as 9,800 degrees Fahrenheit (5,400 degrees Celsius). Surrounding the inner core is the outer core. This layer is about 1,400 miles (2,300 kilometers) thick, made of iron and nickel fluids.\n\nIn between the outer core and crust is the mantle, the thickest layer. This hot, viscous mixture of molten rock is about 1,800 miles (2,900 kilometers) thick and has the consistency of caramel. The outermost layer, Earth's crust, goes about 19 miles (30 kilometers) deep on average on land. At the bottom of the ocean, the crust is thinner and extends about 3 miles (5 kilometers) from the sea floor to the top of the mantle.\n\nSurface\n\nLike Mars and Venus, Earth has volcanoes, mountains and valleys. Earth's lithosphere, which includes the crust (both continental and oceanic) and the upper mantle, is divided into huge plates that are constantly moving. For example, the North American plate moves west over the Pacific Ocean basin, roughly at a rate equal to the growth of our fingernails. Earthquakes result when plates grind past one another, ride up over one another, collide to make mountains, or split and separate.\n\nEarth's global ocean, which covers nearly 70 percent of the planet's surface, has an average depth of about 2.5 miles (4 kilometers) and contains 97 percent of Earth's water. Almost all of Earth's volcanoes are hidden under these oceans. Hawaii's Mauna Kea volcano is taller from base to summit than Mount Everest, but most of it is underwater. Earth's longest mountain range is also underwater, at the bottom of the Arctic and Atlantic oceans. It is four times longer than the Andes, Rockies and Himalayas combined.\n\nAtmosphere\n\nNear the surface, Earth has an atmosphere that consists of 78 percent nitrogen, 21 percent oxygen, and 1 percent other gases such as argon, carbon dioxide and neon. The atmosphere affects Earth's long-term climate and short-term local weather and shields us from much of the harmful radiation coming from the sun. It also protects us from meteoroids, most of which burn up in the atmosphere, seen as meteors in the night sky, before they can strike the surface as meteorites.\n\nPotential for Life\n\nEarth has a very hospitable temperature and mix of chemicals that have made life possible here. Most notably, Earth is unique in that most of our planet is covered in water, since the temperature allows liquid water to exist for extended periods of time. Earth's vast oceans provided a convenient place for life to begin about 3.8 billion years ago.\n\nSome of the features of our planet that make it great for sustaining life are changing due to the ongoing effects of climate change. To find out more visit our sister website, climate.nasa.gov.\n\nMoons\n\nEarth is the only planet that has a single moon. Our moon is the brightest and most familiar object in the night sky. In many ways, the moon is responsible for making Earth such a great home. It stabilizes our planet's wobble, which has made the climate less variable over thousands of years.\n\nEarth sometimes temporarily hosts orbiting asteroids or large rocks. They are typically trapped by Earth's gravity for a a few months or years before returning to an orbit around the sun. Some asteroids will be in a long \"dance\" with Earth as both orbit the sun.\n\nSome moons are bits of rock that were captured by a planet's gravity, but our moon is likely the result of a collision billions of years ago. When Earth was a young planet, a large chunk of rock smashed into it, displacing a portion of Earth's interior. The resulting chunks clumped together and formed our moon. With a radius of 1,080 miles (1,738 kilometers), the moon is the fifth largest moon in our solar system (after Ganymede, Titan, Callisto and Io).\n\nThe moon is farther away from Earth than most people realize. The moon is an average of 238,855 miles (384,400 kilometers) away. That means 30 Earth-sized planets could fit in between Earth and the moon.\n\nRings\n\nEarth has no rings.\n\nMagnetosphere\n\nOur planet's rapid rotation and molten nickel-iron core give rise to a magnetic field, which the solar wind distorts into a teardrop shape in space. (The solar wind is a stream of charged particles continuously ejected from the sun.) When charged particles from the solar wind become trapped in Earth's magnetic field, they collide with air molecules above our planet's magnetic poles. These air molecules then begin to glow and cause aurorae, or the northern and southern lights.\n\nThe magnetic field is what causes compass needles to point to the North Pole regardless of which way you turn. But the magnetic polarity of Earth can change, flipping the direction of the magnetic field. The geologic record tells scientists that a magnetic reversal takes place about every 400,000 years on average, but the timing is very irregular. As far as we know, such a magnetic reversal doesn't cause any harm to life on Earth, and a reversal is very unlikely to happen for at least another thousand years. But when it does happen, compass needles are likely to point in many different directions for a few centuries while the switch is being made. And after the switch is completed, they will all point south instead of north.\n\nExploration\n\nEarth is made up of complex, interactive systems that create a constantly changing world that we are striving to understand. From the vantage point of space, we are able to observe our planet globally, using sensitive instruments to understand the delicate balance among its oceans, air, land and life. NASA satellite observations help study and predict weather, drought, pollution, climate change, and many other phenomena that affect the environment, economy and society.\n\nThis is a small sampling of the history of exploration of Earth from space. For more, visit NASA's Earth Science Division\n\nSignificant Dates:\n1609: Thomas Harriot becomes the first person to use a telescope aimed at the sky and sketches the moon. Later he made the first maps of the moon.\n1610: Galileo Galilei publishes scientific observations of the moon in Sidereus Nuncius (Starry Messenger).\n1959-1976: The U.S.S.R.'s Luna program of 17 robotic missions achieves many \"firsts\" — including the first glimpse of the far side of the moon — and three sample returns.\n1961-1968: The U.S. Ranger, Lunar Orbiter, and Surveyor robotic missions pave the way for Apollo human lunar landings.\n1969: Astronaut Neil Armstrong is the first human to walk on the moon's surface.\n1994-1999: Clementine and Lunar Prospector data suggest that water ice may exist at the lunar poles.\n2003: The European Space Agency's SMART-1 lunar orbiter inventories key chemical elements.\n2007-2008: Japan's second lunar spacecraft, Kaguya, and China's first lunar spacecraft, Chang'e 1, both begin one-year missions orbiting the moon; India's Chandrayaan-1 soon follows in lunar orbit.\n2008: The NASA Lunar Science Institute is formed to help lead NASA's research activities related to lunar exploration goals.\n2009: NASA's Lunar Reconnaissance Orbiter and LCROSS launch together, beginning the U.S. return to lunar exploration. In October, LCROSS was directed to impact a permanently shadowed region near the lunar south pole, resulting in the discovery of water ice. LRO is still exploring the moon from orbit.\n2011: Twin GRAIL spacecraft launch to map the interior of the moon from crust to core, and NASA begins the ARTEMIS mission to study the moon's interior and surface composition.\n2013: NASA launches LADEE to gather detailed information about the structure and composition of the thin lunar atmosphere. The successful mission ended in April 2014.\n14 December 2013: China becomes the third nation to safely land on the moon with the touchdown and deployment of Chang'e 3's Yutu rover.\nPop Culture\n\nStorytellers explore the nature of our planet and possible alternate realities in many books, movies and television shows. The iconic Planet of the Apes film (and many sequels) takes place in a future in which astronauts \"discover\" a planet inhabited by highly intelligent apes and primitive humans, only to realize later, much to their dismay, that — spoiler alert! — it was Earth all along.\n\nIn the long-running and re-booted television series Battlestar Galactica, tired survivors of a war with highly evolved robots called Cylons are on a quest to find Earth, a long-lost colony.\n\nIn other stories, Earth has been abandoned or destroyed, such as in the Joss Whedon series Firefly or the book and its film adaptation The Hitchhiker's Guide to the Galaxy. In the animated feature Titan A.E., Earth has been destroyed by an alien species, but a well-placed planet builder recreates it and all the species that live on it."
                 },
                 {
                 "name" : "Mars",
                 "mass" : 0.107,
                 "period" : 1.880,
                 "rotationPeriod" : 1.030,
                 "A" : 249.200,
                 "P" : 206.600,
                 "E" : 0.094,
                 "distance" : 1.520,
                 "diameter" : 0.532,
                 "angle" : 23.980,
                 "materials": {
                    "diffuse": "art.scnassets/MarsTexture.jpg"
                 },
                 "info":"Though details of Mars' surface are difficult to see from Earth, telescope observations show seasonally changing features and white patches at the poles. For decades, people speculated that bright and dark areas on Mars were patches of vegetation, Mars was a likely place for advanced life forms, and water might exist in the polar caps. When the Mariner 4 spacecraft flew by Mars in 1965, photographs of a bleak, cratered surface shocked many - Mars seemed to be a dead planet. Later missions, however, showed that Mars is a complex planet and holds many mysteries yet to be solved. Chief among them is whether Mars ever had the right conditions to support small life forms called microbes.\n\nMars is a rocky body about half the size of Earth. As with the other terrestrial planets - Mercury, Venus, and Earth - volcanoes, impact craters, crustal movement, and atmospheric conditions such as dust storms have altered the surface of Mars.\n\nMars has two small moons, Phobos and Deimos, that may be captured asteroids. Potato-shaped, they have too little mass for gravity to make them spherical. Phobos, the innermost moon, is heavily cratered, with deep grooves on its surface.\n\nLike Earth, Mars experiences seasons due to the tilt of its rotational axis. Mars' orbit is about 1.5 times farther from the sun than Earth's and is slightly elliptical, so its distance from the sun changes. That affects the length of Martian seasons, which vary in length. The polar ice caps on Mars grow and recede with the seasons. Layered areas near the poles suggest that the planet's climate has changed more than once. Volcanism in the highlands and plains was active more than 3 billion years ago. Some of the giant shield volcanoes are younger, having formed between 1 and 2 billion years ago. Mars has the largest volcano in the solar system, Olympus Mons, as well as a spectacular equatorial canyon system, Valles Marineris.\n\nMars has no global magnetic field today. However, NASA's Mars Global Surveyor orbiter found that areas of the Martian crust in the southern hemisphere are highly magnetized, indicating traces of a magnetic field from 4 billion years ago that remain.\n\nScientists believe that Mars experienced huge floods about 3.5 billion years ago. Though we do not know where the ancient flood water came from, how long it lasted, or where it went, recent missions to Mars have uncovered intriguing hints. In 2002, NASA's Mars Odyssey orbiter detected hydrogen-rich polar deposits, indicating large quantities of water ice close to the surface. Further observations found hydrogen in other areas as well. If water ice permeated the entire planet, Mars could have substantial subsurface layers of frozen water. In 2004, Mars Exploration Rover Opportunity found structures and minerals indicating that liquid water once existed at its landing site. The rover's twin, Spirit, also found the signature of ancient water near its landing site, halfway around Mars from Opportunity's location.\n\nThe cold temperatures and thin atmosphere on Mars do not allow liquid water to exist at the surface for long. The quantity of water required to carve Mars' great channels and flood plains is not evident today. Unraveling the story of water on Mars is important to unlocking its climate history, which will help us understand the evolution of all the planets. Water is an essential ingredient for life as we know it. Evidence of long-term past or present water on Mars holds clues about whether Mars could ever have been a habitat for life.\n\nIn 2008, NASA's Phoenix Mars lander was the first mission to touch water ice in the Martian arctic. Phoenix also observed precipitation (snow falling from clouds), as confirmed by Mars Reconnaissance Orbiter. Soil chemistry experiments led scientists to believe that the Phoenix landing site had a wetter and warmer climate in the recent past (the last few million years). NASA's Mars Science Laboratory mission, with its large rover Curiosity, is examining Martian rocks and soil at Gale Crater, looking for minerals that formed in water, signs of subsurface water, and carbon-based molecules called organics, the chemical building blocks of life. That information will reveal more about the present and past habitability of Mars, as well as whether humans could survive on Mars some day.\nHow Mars Got its Name\nMars was named by the Romans for their god of war because of its red, bloodlike color. Other civilizations also named this planet from this attribute; for example, the Egyptians named it \"Her Desher,\" meaning \"the red one.\"\nSignificant Dates\n1877: Asaph Hall discovers the two moons of Mars, Phobos and Deimos.\n1965: NASA's Mariner 4 sends back 22 photos of Mars, the world's first close-up photos of a planet beyond Earth.\n1976: Viking 1 and 2 land on the surface of Mars.\n1997: Mars Pathfinder lands and dispatches Sojourner, the first wheeled rover to explore the surface of another planet.\n2002: Mars Odyssey begins its mission to make global observations and find buried water ice on Mars.\n2004: Twin Mars Exploration Rovers named Spirit and Opportunity find strong evidence that Mars once had long-term liquid water on the surface.\n2006: Mars Reconnaissance Orbiter begins returning high-resolution images as it studies the history of water on Mars and seasonal changes.\n2008: Phoenix finds signs of possible habitability, including the occasional presence of liquid water and potentially favorable soil chemistry.\n2012: NASA's Mars rover Curiosity lands in Gale Crater and finds conditions once suited for ancient microbial life on Mars."
                 },
                 {
                 "name" : "Jupiter",
                 "mass" : 318,
                 "period" : 11.860,
                 "rotationPeriod" : 0.410,
                 "A" : 816.600,
                 "P" : 740.500,
                 "E" : 0.049,
                 "distance" : 5.200,
                 "diameter" : 11.209,
                 "angle" : 3.080,
                 "materials": {
                    "diffuse": "art.scnassets/JupiterTexture.jpg"
                 },
                 "info": "Jupiter is the fifth planet from our sun and the largest planet in the solar system. Jupiter's stripes and swirls are cold, windy clouds of ammonia and water. The atmosphere is mostly hydrogen and helium, and its iconic Great Red Spot is a giant storm bigger than Earth that has raged for hundreds of years.\nJupiter is surrounded by 53 confirmed moons, as well as 16 provisional ones — for a possible total of 69 moons. Scientists are most interested in the \"Galilean satellites\" — the four largest moons discovered by Galileo Galilei in 1610: Europa, Callisto, Ganymede and Io. Jupiter also has three rings, but they are very hard to see and not nearly as intricate as Saturn's. Jupiter is named for the king of ancient \nRoman gods.\n\nSize and Distance\n\nWith a radius of 43,440.7 miles (69,911 kilometers), Jupiter is 11 times wider than Earth. If Earth were the size of a nickel, Jupiter would be about as big as a basketball.\n\nFrom an average distance of 484 million miles (778 million kilometers), Jupiter is 5.2 astronomical units away from the sun. One astronomical unit (abbreviated as AU), is the distance from the sun to Earth. From this distance, it takes sunlight 43 minutes to travel from the sun to Jupiter.\n\nOrbit and Rotation\n\nJupiter has the shortest day in the solar system. One day on Jupiter takes only about 10 hours (the time it takes for Jupiter to rotate or spin around once), and Jupiter makes a complete orbit around the sun (a year in Jovian time) in about 12 Earth years (4,333 Earth days).\n\nIts equator is tilted with respect to its orbital path around the sun by just 3 degrees. This means Jupiter spins nearly upright and does not have seasons as extreme as other planets do.\n\nFormation\n\nJupiter took shape when the rest of the solar system formed about 4.5 billion years ago, when gravity pulled swirling gas and dust in to become this gas giant. Jupiter took most of the mass left over after the formation of the sun, ending up with more than twice the combined material of the other bodies in the solar system. In fact, Jupiter has the same ingredients as a star, but it did not grow massive enough to ignite.\n\nAbout 4 billion years ago, Jupiter settled into its current position in the outer solar system, where it is the fifth planet from the sun.\n\nStructure\n\nThe composition of Jupiter is similar to that of the sun — mostly hydrogen and helium. Deep in the atmosphere, pressure and temperature increase, compressing the hydrogen gas into a liquid. This gives Jupiter the largest ocean in the solar system — an ocean made of hydrogen instead of water. Scientists think that, at depths perhaps halfway to the planet's center, the pressure becomes so great that electrons are squeezed off the hydrogen atoms, making the liquid electrically conducting like metal. Jupiter's fast rotation is thought to drive electrical currents in this region, generating the planet's powerful magnetic field. It is still unclear if, deeper down, Jupiter has a central core of solid material or if it may be a thick, super-hot and dense soup. It could be up to 90,032 degrees Fahrenheit (50,000 degrees Celsius) down there, made mostly of iron and silicate minerals (similar to quartz).\n\nSurface\n\nAs a gas giant, Jupiter doesn't have a true surface. The planet is mostly swirling gases and liquids. While a spacecraft would have nowhere to land on Jupiter, it wouldn't be able to fly through unscathed either. The extreme pressures and temperatures deep inside the planet crush, melt and vaporize spacecraft trying to fly into the planet.\n\nAtmosphere\n\nJupiter's appearance is a tapestry of colorful cloud bands and spots. The gas planet likely has three distinct cloud layers in its \"skies\" that, taken together, span about 44 miles (71 kilometers). The top cloud is probably made of ammonia ice, while the middle layer is likely made of ammonium hydrosulfide crystals. The innermost layer may be made of water ice and vapor.\n\nThe vivid colors you see in thick bands across Jupiter may be plumes of sulfur and phosphorus-containing gases rising from the planet's warmer interior. Jupiter's fast rotation — spinning once every 10 hours — creates strong jet streams, separating its clouds into dark belts and bright zones across long stretches.\n\nWith no solid surface to slow them down, Jupiter's spots can persist for many years. Stormy Jupiter is swept by over a dozen prevailing winds, some reaching up to 335 miles per hour (539 kilometers per hour) at the equator. The Great Red Spot, a swirling oval of clouds twice as wide as Earth, has been observed on the giant planet for more than 300 years. More recently, three smaller ovals merged to form the Little Red Spot, about half the size of its larger cousin. Scientists do not yet know if these ovals and planet-circling bands are shallow or deeply rooted to the interior.\n\nPotential for Life\n\nJupiter's environment is probably not conducive to life as we know it. The temperatures, pressures and materials that characterize this planet are most likely too extreme and volatile for organisms to adapt to.\n\nWhile planet Jupiter is an unlikely place for living things to take hold, the same is not true of some of its many moons. Europa is one of the likeliest places to find life elsewhere in our solar system. There is evidence of a vast ocean just beneath its icy crust, where life could possibly be supported.\n\nMoons\n\nWith four large moons and many smaller moons, Jupiter forms a kind of miniature solar system. Jupiter has 53 confirmed moons, as well as 16 provisional ones — for a possible total of 69 moons. These newly discovered, provisional moons are reported by astronomers and acknowledged with a temporary designation by the International Astronomical Union. Once their orbits are confirmed, they are included in Jupiter's confirmed moon count.\n\nJupiter's four largest moons — Io, Europa, Ganymede and Callisto — were first observed by the astronomer Galileo Galilei in 1610 using an early version of the telescope. These four moons are known today as the Galilean satellites, and they're some of the most fascinating destinations in our solar system. Io is the most volcanically active body in the solar system. Ganymede is the largest moon in the solar system (even bigger than the planet Mercury). Callisto's very few small craters indicate a small degree of current surface activity. A liquid-water ocean with the ingredients for life may lie beneath the frozen crust of Europa, making it a tempting place to explore.\n\nRings\n\nDiscovered in 1979 by NASA's Voyager 1 spacecraft, Jupiter's rings were a surprise, as they are composed of small, dark particles and are difficult to see except when backlit by the sun. Data from the Galileo spacecraft indicate that Jupiter's ring system may be formed by dust kicked up as interplanetary meteoroids smash into the giant planet's small innermost moons.\n\nMagnetosphere\n\nThe Jovian magnetosphere is the region of space influenced by Jupiter's powerful magnetic field. It balloons 600,000 to 2 million miles (1 to 3 million kilometers) toward the sun (seven to 21 times the diameter or Jupiter itself) and tapers into a tadpole-shaped tail extending more than 600 million miles (1 billion kilometers) behind Jupiter, as far as Saturn's orbit. Jupiter's enormous magnetic field is 16 to 54 times as powerful as that of the Earth. It rotates with the planet and sweeps up particles that have an electric charge. Near the planet, the magnetic field traps swarms of charged particles and accelerates them to very high energies, creating intense radiation that bombards the innermost moons and can damage spacecraft.\n\nJupiter's magnetic field also causes some of the solar system's most spectacular aurorae at the planet's poles.\n\nExploration\n\nWhile Jupiter has been known since ancient times, the first detailed observations of this planet were made by Galileo Galilei in 1610 with a small telescope. More recently, this planet has been visited by passing spacecraft, orbiters and probes.\n\nPioneer 10 and 11 and Voyager 1 and 2 were the first to fly by Jupiter in the 1970s, and since then we've sent Galileo to orbit the gas giant and drop a probe into its atmosphere. Cassini took detailed photos of Jupiter on its way to neighboring Saturn, as did New Horizons on its quest for Pluto and the Kuiper Belt. The next mission is Juno, which arrived in the Jovian system in July 2016.\n\nSignificant Dates:\n1610: Galileo Galilei makes the first detailed observations of Jupiter.\n1973: Pioneer 10 becomes the first spacecraft to cross the asteroid belt and fly past Jupiter.\n1979: Voyager 1 and 2 discover Jupiter's faint rings, several new moons and volcanic activity on Io's surface.\n1992: Ulysses swung by Jupiter on Feb. 8, 1992. The giant planet's gravity bent the spacecraft's flight path southward and away from the ecliptic plane, putting the probe into a final orbit that would take it over the sun's south and north poles.\n1994: Astronomers observe as pieces of comet Shoemaker-Levy 9 collide with Jupiter's southern hemisphere.\n1995-2003: The Galileo spacecraft drops a probe into Jupiter's atmosphere and conducts extended observations of Jupiter and its moons and rings.\n2000: Cassini makes its closest approach to Jupiter at a distance of approximately 6.2 million miles (10 million kilometers), taking a highly detailed true color mosaic photo of the gas giant.\n2007: Images taken by NASA's New Horizons spacecraft, on the way to Pluto, show new perspectives on Jupiter's atmospheric storms, the rings, volcanic Io, and icy Europa.\n2009: On 20 July, almost exactly 15 years after fragments of comet Shoemaker-Levy slammed into Jupiter, a comet or asteroid crashes into the giant planet's southern hemisphere.\n2011: Juno launches to examine Jupiter's chemistry, atmosphere, interior structure and magnetosphere.\n2016: NASA's Juno spacecraft arrives at Jupiter, conducting an in-depth investigation of the planet's atmosphere, deep structure and magnetosphere for clues to its origin and evolution.\nPop Culture\n\nThe biggest planet in our solar system, Jupiter also has a large presence in pop culture, including many movies, TV shows, video games and comics. Jupiter was a notable destination in the Wachowski siblings' science fiction spectacle Jupiter Ascending, while various Jovian moons provide settings for Cloud Atlas, Futurama, Power Rangers, and Halo, among many others. In Men in Black when Agent J — played by Will Smith — mentions he thought one of his childhood teachers was from Venus, Agent K — played by Tommy Lee Jones — replies that she is actually from one of Jupiter's moons."
                 },
                 {
                 "name" : "Saturn",
                 "mass" : 95,
                 "period" : 29.460,
                 "rotationPeriod" : 0.440,
                 "A" : 1514.500,
                 "P" : 1352.600,
                 "E" : 0.057,
                 "distance" : 9.580,
                 "diameter" : 9.440,
                 "ring" : {
                     "inner" : 1.310,
                     "outer" : 9.398,
                     "height" : 0.001,
                     "image" : "art.scnassets/SaturnRingsTexture.png"
                 },
                 "angle" : 26.730,
                 "materials": {
                    "diffuse": "art.scnassets/SaturnTexture.jpg"
                 },
                 "info": "The second largest planet in our solar system, adorned with thousands of beautiful ringlets, Saturn is unique among the planets. It is not the only planet to have rings -- made of chunks of ice and rock -- but none are as spectacular or as complicated as Saturn's. Like fellow gas giant Jupiter, Saturn is a massive ball of mostly hydrogen and helium.\n\nSurrounding by 53 confirmed and nine provisional moons, Saturn is home to some of the most fascinating landscapes in our solar system. From the jets of Enceladus to the methane lakes on smoggy Titan, the Saturn system is a rich source of scientific discovery and still holds many mysteries.\n\nThe farthest planet from Earth observable by the unaided human eye, Saturn has been known since ancient times and is named for the Roman god of agriculture and wealth. The Greek equivalent was Cronos, the father of Zeus\/Jupiter.\nFormation:\nWhen the solar system settled into its current layout about 4.5 billion years ago, Saturn formed when gravity pulled swirling gas and dust in to become a planet 886 million miles (1.4 billion km) from the sun. Like Jupiter, Saturn is mostly made of hydrogen and helium, the same two main components that make up the sun.\nSaturn rotates in the same direction as the Earth, which is west to east, but it does this far faster than Earth, spinning around once in just 10.7 hours. This fast spin causes Saturn to bulge out in the middle, making its equatorial radius nearly 10 percent wider than its polar radius.\n\nIts axis is tilted by 26.73 degrees with respect to its orbit around the sun, which is similar to Earth's 23.5-degree tilt. This means that, like Earth, Saturn experiences seasons.\n\nWhile the days on Saturn are short, the years are long. The sixth planet from the sun takes 29 Earth years, or 10,756 Earth days, to complete one revolution around the sun.\n\nStructure:\nLike Jupiter, Saturn is made mostly of hydrogen and helium. At Saturn's center is a dense core of rock, ice, water, and other compounds made solid by the intense pressure and heat. It is enveloped by liquid metallic hydrogen, inside a layer of liquid hydrogen -- similar to Jupiter's core but considerably smaller.\n\nIt's hard to imagine, but Saturn is the only planet in our solar system that is less dense than water. The giant gas planet could float in a bathtub -- if such a colossal thing existed.\n\nSurface\nAs a gas giant, Saturn doesn't have a true surface. The planet is mostly swirling gases and liquids. While a spacecraft would have nowhere to land on Saturn, it wouldn't be able to fly through unscathed either. The extreme pressures and temperatures deep inside the planet would crush, melt and vaporize a metal spacecraft trying to fly through the planet.\n\nAtmosphere:\nSaturn is blanketed with clouds, stripes and storms. Overall the planet is tan and light brown in color, due to a mixture of yellow ammonia crystals in the upper atmosphere.\n\nWinds in the upper atmosphere reach 1,600 feet (500 meters) per second in the equatorial region. In contrast, the strongest hurricane-force winds on Earth top out at about 360 feet (110 meters) per second. And the pressure -- the same kind you feel when you dive deep underwater -- is so powerful it squeezes gas into liquid. Even a metal spacecraft would be smashed in Saturn's intense atmosphere.\n\nSaturn's north pole has an interesting atmospheric feature -- a six-sided jet stream. This hexagon-shaped pattern was first noticed in images from the Voyager I spacecraft and has been more closely observed by the Cassini spacecraft since. Spanning about 20,000 miles (30,000 km) across, the hexagon is a wavy jet stream of 200-mile-per-hour winds (about 322 kilometers per hour) with a massive, rotating storm at the center. There is no weather feature like it anywhere else in the solar system.\n\nPotential for Life:\nSaturn's environment is not conducive to life as we know it. The temperatures, pressures, radiation levels and materials that characterize this planet are most likely too extreme and volatile for organisms to adapt to.\n\nWhile planet Saturn is an unlikely place for living things to take hold, the same is not true of some of its many moons. Satellites like Enceladus and Titan, home to internal oceans, could possibly support life.\n\nMoons:\nSaturn is home to a vast array of intriguing and unique worlds. From the cloud-shrouded surface of Titan to crater-riddled Phoebe, each of Saturn's moons tells another piece of the story surrounding the Saturn system. Currently Saturn has 53 confirmed moons with nine additional provisional moons awaiting confirmation.\n\nSaturn's largest satellite, Titan, is a bit bigger than the planet Mercury. Titan is the second-largest moon in the solar system; only Jupiter's moon Ganymede is bigger.\n\nRings:\nSaturn's rings are believed to be pieces of comets, asteroids or shattered moons that broke up before they reached the planet, torn apart by Saturn's powerful gravity. They are made of billions of small chunks of ice and rock. The ring particles mostly range from tiny, dust-sized icy grains to chunks as big as a house, though a few particles are as large as mountains. The rings would look mostly white if you looked at them from the cloud tops of Saturn.\n\nSaturn's ring system extends up to 175,000 miles (282,000 km) from the planet, yet the vertical height is typically about 30 feet (10 meters) in the main rings. Among the ring system are \"braided\" rings, ringlets and \"spokes\" -- dark features in the rings that form and initially circle the planet at different rates from that of the surrounding ring material. Two tiny moons, Pan and Daphnis, orbit in gaps (Encke and Keeler gaps, respectively) in the rings and keep the gaps open. Other particles are too tiny to see, but create propeller-shaped objects in the rings that let us know they are there.\n\nNamed alphabetically in the order they were discovered, the rings are relatively close to each other, with the exception of the Cassini Division, a gap measuring 2,920 miles (4,700 km). The main rings are, working outward from the planet, known as C, B and A. The Cassini Division is the largest gap in the rings and separates Rings B and A. In addition, a number of fainter rings have been discovered more recently. The D Ring is exceedingly faint and closest to the planet. The F Ring is a narrow feature just outside the A Ring. Beyond that are two far fainter rings named G and E. Interestingly, each ring orbits at a different speed around the planet.\n\nMagnetosphere:\nSaturn's magnetic field is smaller than Jupiter's but still 578 times as powerful as Earth's. Saturn, the rings, and many of the satellites lie totally within Saturn's enormous magnetosphere, the region of space in which the behavior of electrically charged particles is influenced more by Saturn's magnetic field than by the solar wind.\n\nAurorae occur when charged particles spiral into a planet's atmosphere along magnetic field lines. On Earth, these charged particles come from the solar wind. Cassini showed that at least some of Saturn's aurorae are like Jupiter's and are largely unaffected by the solar wind. Instead, these aurorae are caused by a combination of particles ejected from Saturn's moons and Saturn's magnetic field's rapid rotation rate. But these \"non-solar-originating\" aurorae are not completely understood yet.\n\nExploration\n\nSaturn was the most distant of the five planets known to the ancients. In 1610, Italian astronomer Galileo Galilei was the first to gaze at Saturn through a telescope. To his surprise, he saw a pair of objects on either side of the planet. He sketched them as separate spheres, thinking that Saturn was triple-bodied. In 1659, Dutch astronomer Christiaan Huygens, using a more powerful telescope than Galileo's, proposed that Saturn was surrounded by a thin, flat ring.\n\nMore recently, the Saturn system has been visited by passing spacecraft, the Cassini orbiter and the Huygens probe.\n\n700 BCE: The oldest written records documenting Saturn are attributed to the Assyrians, described the ringed planet as a sparkle in the night and named it \"Star of Ninib.\"\n\n400 BCE: Ancient Greek astronomers named what they thought was a wandering star in honor of Kronos, the god of agriculture. The Romans later change the name to Saturn, their god of agriculture.\n\nJuly 1610:: Galileo Galilei spots Saturn's rings through a telescope, but mistakes them for a \"triple planet.\"\n\n1655:: Christiaan Huygens discovers Saturn's rings and its largest moon, Titan.\n\n1675:: Italian-born astronomer Jean-Dominique Cassini discovered a \"division\" between what are now called the A and B rings.\n\n1 Sep 1979:: Pioneer 11 was the first spacecraft to reach Saturn. Among Pioneer 11's many discoveries are Saturn's F ring and a new moon.\n\n1979 and 1981:: In its 1979 flyby of Saturn, Voyager 1 reveals the intricate structure of the ring system, consisting of thousands of bands. Flying even close to Saturn in 1981, Voyager 2 provided more detailed images and documents the thinness of some of the rings.\n\n1 Jul 2004:: NASA's Cassini spacecraft becomes the first to orbit Saturn, beginning a decade-long mission that revealed many secrets and surprises about Saturn and its system of rings and moons.\n\n14 Jan 2005:: The European Space Agency's Huygens probe is the first spacecraft to make a soft landing on the surface of another planet's moon - Saturn's giant moon Titan. The probe provided a detailed study Titan's atmosphere during a 2 hour and 27 minute descent and relayed data and images from Titan's muddy surface for another hour and 10 minutes.\n\n17 Sep 2006 Scientists discover a new ring. The new ring coincides with the orbits of Saturn's moons Janus and Epimetheus. Images obtained during the longest solar occultation of Cassini's four-year mission revealed the ring. During a solar occultation, the sun passes directly behind Saturn causing the rings to be brilliantly backlit. Usually, an occultation lasts only about an hour, but in this instance it lasted 12 hours.\n\nPop Culture\nPerhaps the most iconic of all the planets in our solar system, Saturn is heavily present in pop culture. It provides a backdrop for numerous science fiction stories, movies and TV shows, comics, and video games, including the Cthulhu Mythos, WALL-E, 2001: A Space Odyssey, Star Trek, Dead Space 2 and Final Fantasy VII. In Tim Burton's film Beetlejuice, a dusty, fictional Saturn is populated by giant sandworms. Saturn is also the namesake of Saturday."
                 },
                 {
                 "name" : "Uranus",
                 "mass" : 15,
                 "period" : 84.010,
                 "rotationPeriod" : 0.720,
                 "A" : 3003.600,
                 "P" : 2741.300,
                 "E" : 0.046,
                 "distance" : 19.200,
                 "diameter" : 4.007,
                     "ring" : {
                     "inner" : 2.030,
                     "outer" : 2.180,
                     "height" : 0.001,
                     "image" : "art.scnassets/UranusRingsTexture.png"
                 },
                 "angle" : 97.920,
                 "materials": {
                    "diffuse": "art.scnassets/UranusTexture.jpg"
                 },
                 "info": "The seventh planet from the sun with the third largest diameter in our solar system, Uranus is very cold and windy. The ice giant is surrounded by 13 faint rings and 27 small moons as it rotates at a nearly 90-degree angle from the plane of its orbit. This unique tilt makes Uranus appear to spin on its side, orbiting the sun like a rolling ball.\nThe first planet found with the aid of a telescope, Uranus was discovered in 1781 by astronomer William Herschel, although he originally thought it was either a comet or a star. It was two years later that the object was universally accepted as a new planet, in part because of observations by astronomer Johann Elert Bode.\n\nWilliam Herschel tried unsuccessfully to name his discovery Georgium Sidus after King George III. Instead the planet was named for Uranus, the Greek god of the sky, as suggested by Johann Bode.\nSize and Distance\nWith a radius of 15,759.2 miles (25,362 kilometers), Uranus is 4 times wider than Earth. If Earth was the size of a nickel, Uranus would be about as big as a softball.\n\nFrom an average distance of 1.8 billion miles (2.9 billion kilometers), Uranus is 19.8 astronomical units away from the sun. One astronomical unit (abbreviated as AU), is the distance from the sun to Earth. From this distance, it takes sunlight 2 hours and 40 minutes to travel from the sun to Uranus.\n\nOrbit and Rotation\n\nOne day on Uranus takes about 17 hours (the time it takes for Uranus to rotate or spin once). And Uranus makes a complete orbit around the sun (a year in Uranian time) in about 84 Earth years (30,687 Earth days).\n\nUranus is the only planet whose equator is nearly at a right angle to its orbit, with a tilt of 97.77 degrees — possibly the result of a collision with an Earth-sized object long ago. This unique tilt causes the most extreme seasons in the solar system. For nearly a quarter of each Uranian year, the sun shines directly over each pole, plunging the other half of the planet into a 21-year-long, dark winter.\n\nUranus is also one of just two planets that rotate in the opposite direction than most of the planets (Venus is the other one), from east to west.\n\nFormation\n\nUranus took shape when the rest of the solar system formed about 4.5 billion years ago, when gravity pulled swirling gas and dust in to become this ice giant. Like its neighbor Neptune, Uranus likely formed closer to the sun and moved to the outer solar system about 4 billion years ago, where it is the seventh planet from the sun.\n\nStructure\n\nUranus is one of two ice giants in the outer solar system (the other is Neptune). Most (80 percent or more) of the planet's mass is made up of a hot dense fluid of \"icy\" materials - water, methane and ammonia - above a small rocky core. Near the core, it heats up to 9,000 degrees Fahrenheit (4,982 degrees Celsius).\n\nUranus is slightly larger in diameter than its neighbor Neptune, yet smaller in mass. It is the second least dense planet; Saturn is the least dense of all.\n\nUranus gets its blue-green color from methane gas in the atmosphere. Sunlight passes through the atmosphere and is reflected back out by Uranus' cloud tops. Methane gas absorbs the red portion of the light, resulting in a blue-green color.\n\nSurface\n\nAs an ice giant, Uranus doesn't have a true surface. The planet is mostly swirling fluids. While a spacecraft would have nowhere to land on Uranus, it wouldn't be able to fly through its atmosphere unscathed either. The extreme pressures and temperatures would destroy a metal spacecraft.\n\nAtmosphere\n\nUranus' atmosphere is mostly hydrogen and helium, with a small amount of methane and traces of water and ammonia. The methane gives Uranus its signature blue color.\n\nWhile Voyager 2 saw only a few discrete clouds, a Great Dark Spot and a small dark spot during its flyby in 1986, more recent observations reveal that Uranus exhibits dynamic clouds as it approaches equinox, including rapidly changing bright features.\n\nUranus' planetary atmosphere, with a minimum temperature of 49K (-224.2 degrees Celsius) makes it even colder than Neptune in some places.\n\nWind speeds can reach up to 560 miles per hour (900 kilometers per hour) on Uranus. Winds are retrograde at the equator, blowing in the reverse direction of the planet's rotation. But closer to the poles, winds shift to a prograde direction, flowing with Uranus' rotation.\n\nPotential for Life\n\nUranus' environment is not conducive to life as we know it. The temperatures, pressures and materials that characterize this planet are most likely too extreme and volatile for organisms to adapt to.\n\nMoons\n\nUranus has 27 known moons. While most of the satellites orbiting other planets take their names from Greek or Roman mythology, Uranus' moons are unique in being named for characters from the works of William Shakespeare and Alexander Pope.\n\nAll of Uranus' inner moons appear to be roughly half water ice and half rock. The composition of the outer moons remains unknown, but they are likely captured asteroids.\n\nRings\n\nUranus has two sets of rings. The inner system of nine rings consists mostly of narrow, dark grey rings. There are two outer rings: the innermost one is reddish like dusty rings elsewhere in the solar system, and the outer ring is blue like Saturn's E ring.\n\nIn order of increasing distance from the planet, the rings are called Zeta, 6, 5, 4, Alpha, Beta, Eta, Gamma, Delta, Lambda, Epsilon, Nu and Mu. Some of the larger rings are surrounded by belts of fine dust.\n\nMagnetosphere\n\nUranus has an unusual, irregularly shaped magnetosphere. Magnetic fields are typically in alignment with a planet's rotation, but Uranus' magnetic field is tipped over: the magnetic axis is tilted nearly 60 degrees from the planet's axis of rotation, and is also offset from the center of the planet by one-third of the planet's radius.\n\nAuroras on Uranus are not in line with the poles (like they are on Earth, Jupiter and Saturn) due to the lopsided magnetic field.\n\nThe magnetosphere tail behind Uranus opposite the sun extends into space for millions of miles. Its magnetic field lines are twisted by Uranus' sideways rotation into a long corkscrew shape.\n\nExploration\n\nOnly one spacecraft has visited distant Uranus. After traveling more than 1.8 billion miles (3 billion kilometers) in nine years, NASA's Voyager 2 gathered much of its critical information about the mysterious planet, including its rings and moons, in just six hours.\n\nSignificant Dates:\n13 Mar 1781: British astronomer William Herschel discovers Uranus - the first new planet discovered since ancient times - while searching for faint stars.\n1787-1851: Four Uranian moons are discovered and named Titania, Oberon, Ariel and Umbriel..\n1948: Another moon, Miranda, is discovered.\n10 Mar 1977: While observing Uranus' passing in front of a distant star (SAO 158687), scientists at the Kuiper Airborne Observatory and the Perth Observatory in Australia were eager for a rare chance to observe the distant planet. Observations before and after the main event led to a major discovery: Uranus, like Saturn, is encircled with rings.\n24 Jan 1986: NASA's Voyager 2 made the first - and so far the only - visit to Uranus. The spacecraft came within 50,600 miles (81,500 kilometers) of the planet's cloud tops. Voyager discovered 10 new moons, two new rings and a magnetic field stronger than that of Saturn.\n22 Dec 2005: NASA announces the discovery of a new pair of rings around Uranus and two new, small moons (Mab and Cupid) orbiting the planet from photographs taken by the Hubble Space Telescope. The largest ring discovered by Hubble is twice the diameter of the planet's previously known rings.\n2006: Observations made at the Keck Observatory and by the Hubble Space Telescope show that Uranus' outer ring is colored blue while the new inner ring is reddish.\nDec 2007: Uranus reaches equinox. Equinox is when the planet is fully illuminated as the sun passes over its equator. Equinox also brings a ring-plane crossing, when Uranus' rings appear to get narrower as they pass through, appearing edge-on and then widen again as seen from Earth.\n18 Mar 2011: New Horizons passes the orbit of Uranus on its way to Pluto, becoming the first spacecraft to journey beyond Uranus' orbit since Voyager 2. However, Uranus was not near the crossing point. The spacecraft is asleep during most of its eight-year interplanetary trek from Jupiter to Pluto. Mission controllers do wake up New Horizons for 50 days each year to perform necessary checkups on its instruments.\n\nPop Culture\n\nUranus is the \"butt\" of more than a few jokes and witty (and not so witty) puns, but it's also a frequent destination in various fictional stories, such as the video game Mass Effect and TV shows like Doctor Who. The radioactive element uranium was named after Uranus when it was discovered in 1789, just eight years after the planet was discovered."
                 },
                 {
                 "name" : "Neptune",
                 "mass" : 17,
                 "period" : 164.800,
                 "rotationPeriod" : 0.720,
                 "A" : 4545.700,
                 "P" : 4444.500,
                 "E" : 0.011,
                 "distance" : 30.050,
                 "diameter" : 3.883,
                 "angle" : 28.800,
                 "materials": {
                    "diffuse": "art.scnassets/NeptuneTexture.jpg"
                 },
                 "info":"The ice giant Neptune was the first planet located through mathematical predictions rather than through regular observations of the sky. (Galileo had recorded it as a fixed star during observations with his small telescope in 1612 and 1613.) When Uranus didn't travel exactly as astronomers expected it to, a French mathematician, Urbain Joseph Le Verrier, proposed the position and mass of another as yet unknown planet that could cause the observed changes to Uranus' orbit. After being ignored by French astronomers, Le Verrier sent his predictions to Johann Gottfried Galle at the Berlin Observatory, who found Neptune on his first night of searching in 1846. Seventeen days later, its largest moon, Triton, was also discovered.\n\nNearly 4.5 billion kilometers (2.8 billion miles) from the Sun, Neptune orbits the Sun once every 165 years. It is invisible to the naked eye because of its extreme distance from Earth. Interestingly, the highly eccentric orbit of the dwarf planet Pluto brings Pluto inside Neptune's orbit for a 20-year period out of every 248 Earth years. Pluto can never crash into Neptune, though, because for every three laps Neptune takes around the Sun, Pluto makes two. This repeating pattern prevents close approaches of the two bodies.\n\nThe main axis of Neptune's magnetic field is tipped over by about 47 degrees compared with the planet's rotation axis. Like Uranus, whose magnetic axis is tilted about 60 degrees from the axis of rotation, Neptune's magnetosphere undergoes wild variations during each rotation because of this misalignment. The magnetic field of Neptune is about 27 times more powerful than that of Earth.\n\nNeptune's atmosphere extends to great depths, gradually merging into water and other melted ices over a heavier, approximately Earth-size solid core. Neptune's blue color is the result of methane in the atmosphere. Uranus' blue-green color is also the result of atmospheric methane, but Neptune is a more vivid, brighter blue, so there must be an unknown component that causes the more intense color.\n\nDespite its great distance and low energy input from the Sun, Neptune's winds can be three times stronger than Jupiter's and nine times stronger than Earth's. In 1989, Voyager 2 tracked a large, oval-shaped, dark storm in Neptune's southern hemisphere. This \"Great Dark Spot\" was large enough to contain the entire Earth, spun counterclockwise, and moved westward at almost 1,200 kilometers (750 miles) per hour. Subsequent images taken by the Hubble Space Telescope showed no sign of this Great Dark Spot, but did reveal the appearance and then fading of two other Great Dark Spots over the last decade. Voyager 2 also imaged clouds casting shadows on a lower cloud deck, enabling scientists to visually measure the altitude differences between the upper and lower cloud decks.\n\nNeptune has six known rings. Voyager 2's observations confirmed that these unusual rings are not uniform but have four thick regions (clumps of dust) called arcs. The rings are thought to be relatively young and short-lived.\n\nNeptune has 13 known moons, six of which were discovered by Voyager 2. A 14th tiny, very dim, moon was discovered in 2013 and awaits official recognition. Triton, Neptune's largest moon, orbits the planet in the opposite direction compared with the rest of the moons, suggesting that it may have been captured by Neptune in the distant past. Triton is extremely cold - temperatures on its surface are about -235 degrees Celsius (-391 degrees Fahrenheit). Despite this deep freeze at Triton, Voyager 2 discovered geysers spewing icy material upward more than 8 kilometers (5 miles). Triton's thin atmosphere, also discovered by Voyager, has been detected from Earth several times since, and is growing warmer - although scientists do not yet know why.\n\nHow Neptune Got its Name\nNeptune was predicted by John Couch Adams and Urbain Le Verrier. The men independently accounted for the irregularities in the motion of Uranus by correctly predicting the orbital elements of a trans-Uranian planet. Using the predicted parameters of Le Verrier (Adams never published his predictions), Johann Galle discovered the planet in 1846. Galle wanted to name the planet for Le Verrier, but that was not acceptable to the international astronomical community. Instead, this planet is named for the Roman god of the sea.\n\nSignificant Dates\n1846: Using mathematical calculations, astronomers discover Neptune, increasing the number of known planets to eight. Neptune's largest moon, Triton, is found the same year.\n1984: Astronomers find evidence for the existence of a ring system around Neptune.\n1989: Voyager 2 becomes the first and only spacecraft to visit Neptune, passing about 4,800 km (2,983 miles) above the planet's north pole.\n1998: Scientists using telescopes on Earth and in space image Neptune's rings and ring arcs for the first time.\n2003: Using improved observing techniques, astronomers discover five new moons orbiting Neptune.\n2005: Scientists using the Keck Observatory image the outer rings and find that some of the ring arcs have deteriorated.\n2011: Neptune completes its first 165-year orbit of the sun since its discovery in 1846.\n2013: A scientist studying Neptune's ring arcs in archival Hubble Space Telescope images finds a previously unknown 14th moon of Neptune, provisionally designated S\/2004 N 1."
                 }
            ]
}

